backend/app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

SELECT "candidates".* FROM "candidates" WHERE "candidates"."voting_event_id" = ?  [["voting_event_id", 21]]
---
  def by_voting_event
    @candidates = Candidate.where(voting_event_id: params[:voting_event_id])

INSERT INTO "candidates" ("role", "userName", "voting_event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["role", "President"], ["userName", "Raila Odinga"], ["voting_event_id", 1], ["user_id", 1], ["created_at", "2023-08-06 10:35:19.521128"], ["updated_at", "2023-08-06 10:35:19.521128"]]
---
  def create
    candidate = Candidate.new(candidate_params)

    if candidate.save

UPDATE "candidates" SET "role" = ?, "updated_at" = ? WHERE "candidates"."id" = ?  [["role", "MP"], ["updated_at", "2023-07-29 11:45:40.432368"], ["id", 1]]
---
  def update
    if @candidate.update(candidate_params)

DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
  def destroy
    @candidate.destroy

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_candidate
    @candidate = Candidate.find(params[:id])