backend/app/controllers/user_votes_controller.rb

SELECT "user_votes".* FROM "user_votes"
---
  def index
    @user_votes = UserVote.all

INSERT INTO "user_votes" ("user_id", "voting_event_id", "candidate_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["voting_event_id", 2], ["candidate_id", 3], ["created_at", "2023-08-06 20:24:22.289958"], ["updated_at", "2023-08-06 20:24:22.289958"]]
---
  def create
    puts "@current_user: #{@current_user.inspect}"
    user_vote = UserVote.new(user_vote_params)
    user_vote.user_id = @current_user.id

    if user_vote.save

UPDATE "user_votes" SET "eventName" = ?, "updated_at" = ? WHERE "user_votes"."id" = ?  [["eventName", " by-elections"], ["updated_at", "2023-07-29 11:32:21.484906"], ["id", 1]]
---
  def update
    @user_vote.user_id = @current_user.id

    if @user_vote.update(user_vote_params)

DELETE FROM "user_votes" WHERE "user_votes"."id" = ?  [["id", 1]]
---
  def destroy
    @user_vote.destroy

SELECT "user_votes".* FROM "user_votes" WHERE "user_votes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_user_vote
    @user_vote = UserVote.find(params[:id])